In [1]:
import pandas as pd
import numpy as np

In [2]:
#Group

In [3]:
d={'company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'person':['rahul','sachin','Gaurav','pravin','KIm','sam'],
  'sales':[300,200,400,500,100,250]}
d

{'company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'person': ['rahul', 'sachin', 'Gaurav', 'pravin', 'KIm', 'sam'],
 'sales': [300, 200, 400, 500, 100, 250]}

In [4]:
df=pd.DataFrame(d)
df

  company  person  sales
0    GOOG   rahul    300
1    GOOG  sachin    200
2    MSFT  Gaurav    400
3    MSFT  pravin    500
4      FB     KIm    100
5      FB     sam    250

In [5]:
comp=df.groupby('company')
comp

In [6]:
list(comp)

[('FB',
    company person  sales
  4      FB    KIm    100
  5      FB    sam    250),
 ('GOOG',
    company  person  sales
  0    GOOG   rahul    300
  1    GOOG  sachin    200),
 ('MSFT',
    company  person  sales
  2    MSFT  Gaurav    400
  3    MSFT  pravin    500)]

In [7]:
comp.mean()

         sales
company
FB       175.0
GOOG     250.0
MSFT     450.0

In [8]:
comp.sum()

         sales
company
FB         350
GOOG       500
MSFT       900

In [9]:
comp.std()

              sales
company
FB       106.066017
GOOG      70.710678
MSFT      70.710678

In [10]:
comp.min()

         person  sales
company
FB          KIm    100
GOOG      rahul    200
MSFT     Gaurav    400

In [11]:
comp.max()

         person  sales
company
FB          sam    250
GOOG     sachin    300
MSFT     pravin    500

In [12]:
comp.count()

         person  sales
company
FB            2      2
GOOG          2      2
MSFT          2      2

In [13]:
comp.describe()

        sales
        count   mean         std    min    25%    50%    75%    max
company
FB        2.0  175.0  106.066017  100.0  137.5  175.0  212.5  250.0
GOOG      2.0  250.0   70.710678  200.0  225.0  250.0  275.0  300.0
MSFT      2.0  450.0   70.710678  400.0  425.0  450.0  475.0  500.0

In [14]:
comp.describe().transpose()

company              FB        GOOG        MSFT
sales count    2.000000    2.000000    2.000000
      mean   175.000000  250.000000  450.000000
      std    106.066017   70.710678   70.710678
      min    100.000000  200.000000  400.000000
      25%    137.500000  225.000000  425.000000
      50%    175.000000  250.000000  450.000000
      75%    212.500000  275.000000  475.000000
      max    250.000000  300.000000  500.000000

In [15]:
comp.describe().loc['GOOG']

sales  count      2.000000
       mean     250.000000
       std       70.710678
       min      200.000000
       25%      225.000000
       50%      250.000000
       75%      275.000000
       max      300.000000
Name: GOOG, dtype: float64

In [16]:
comp.describe().transpose()['GOOG']

sales  count      2.000000
       mean     250.000000
       std       70.710678
       min      200.000000
       25%      225.000000
       50%      250.000000
       75%      275.000000
       max      300.000000
Name: GOOG, dtype: float64

In [17]:
#Operations

In [18]:
d1={'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']}
d1

{'col1': [1, 2, 3, 4],
 'col2': [444, 555, 666, 444],
 'col3': ['abc', 'def', 'ghi', 'xyz']}

In [19]:
df1=pd.DataFrame(d1)
df1

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
df1['col2'].unique()

array([444, 555, 666], dtype=int64)

In [21]:
df1['col2'].nunique()

3

In [22]:
df1['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [23]:
df1

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [24]:
df1[df1['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [25]:
df1['col2']==444

0     True
1    False
2    False
3     True
Name: col2, dtype: bool

In [26]:
df1[df1['col2']==444]

   col1  col2 col3
0     1   444  abc
3     4   444  xyz

In [27]:
df1[(df1['col1']>2) & (df1['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [28]:
#applying Functions

In [29]:
def find_cube(a):
    return a*a*a
find_cube(8)

512

In [30]:
df1

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [31]:
df1['col1'].apply(find_cube)           ########

0     1
1     8
2    27
3    64
Name: col1, dtype: int64

In [32]:
df1['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [33]:
df1['col1'].sum()

10

In [34]:
#delete the column
del df1['col1']
df1

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [35]:
df.columns

Index(['company', 'person', 'sales'], dtype='object')

In [36]:
df1.sort_values('col2')    #for permenant sorting use inplace

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [37]:
df1

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [38]:
data={'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
     'C':['x','y','x','y','x','y'],
     'D':[1,2,3,3,2,1]}
df2=pd.DataFrame(data)
df2

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  2
2  foo  two  x  3
3  bar  two  y  3
4  bar  one  x  2
5  bar  one  y  1

In [39]:
df2.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  2.0  1.0
    two  NaN  3.0
foo one  1.0  2.0
    two  3.0  NaN

In [40]:
#Data inpot and output
import os
os.getcwd()

'C:\\Users\\2000139\\Python practice\\Machine Lerning Practice'

In [41]:
pwd

'C:\\Users\\2000139\\Python practice\\Machine Lerning Practice'

In [42]:
os.chdir("C://Users//2000139//OneDrive - TCS COM PROD//Desktop//dataset")

In [43]:
pwd

'C:\\Users\\2000139\\OneDrive - TCS COM PROD\\Desktop\\dataset'

In [44]:
dd=pd.read_csv('example.txt')
dd

    a   b   c   d
0   1   2   3   4
1   5   6   7   8
2  10  11  12  13

In [45]:
dd.to_csv('Sunday',index=False)

In [46]:
#read html like from links
df3=pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [47]:
df3[0]

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534
...,...,...,...,...,...,...,...
558,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
559,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
560,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
561,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
562,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645

In [49]:
pp=pd.read_excel('Titanic.xls')
pp

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Unnamed: 12
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5,21171,7.25,NaN,NaN
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC,17599,71.2833,C85,NaN
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2.,3101282,7.925,NaN,NaN
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1,C123,S,NaN
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.05,NaN,S,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13,NaN,S,NaN
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30,B42,S,NaN
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C.,6607,23.45,NaN,NaN
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30,C148,C,NaN
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,NaN